[
    {
        "name": "Kenrokuen",
        "location": {
            "latitude": 36.5621321,
            "longitude": 136.6604628
        },
        "description": "Kenrokuen is a Japanese garden located in Kanazawa City, Ishikawa Prefecture. It is designated as a national special scenic spot. The area is about 11.7 hectares. It is a pond spring strolling garden that represents the Edo period and originated from the clan garden built on the outer hull of Kanazawa Castle by the Kaga domain in the middle of the 17th century. It is counted as one of. In the \"Michelin Tourist Guide\" released on March 16, 2009, it was selected as the highest rated 3 star. The name of the garden was named because Matsudaira Sadanobu quoted \"Rakuyo Meienki\" and has six landscapes: Hongdae, Yue, Human Power, Aoko, Izumi, and View. Each of the four seasons has a deep taste and shows various expressions depending on the season, but especially the snow hanging that is done in preparation for snow is a winter tradition. It is also one of the best cherry blossom, plum, and autumn leaves spots in the prefecture, and has been selected as one of Japan's Top 100 Cherry Blossom Spots."
    },
	{
        "name": "Kanazawa Castle",
        "location": {
            "latitude": 36.5683812,
            "longitude": 136.6616254
        },
        "description": "It is a ladder-type Hirayama castle from the Warring States period to the Edo period, which was built at the tip of the Kodatsuno plateau between the Saigawa and Asano rivers that flow almost in the center of the Kanazawa plain (it was also called \"Oyama\"). Due to the terrain. The tip of the plateau was regarded as the tail of the mountain). The appearance of the white plastered walls with roof tiles and white lead tiles on the roof, which can be seen in the turrets and gates, and the windows of the Kara Gable and Irimaya Gable attached to the first turret and the wall are Kanazawa Castle. It is a characteristic of the architecture of. This place was the base of Kaga Ikko-ikki and was the temple of the Jodo Shinshu sect, \"Oyama Gobo\". Although it is a temple, it was also a fortress that can be called a castle around the stone wall, like Ishiyama Hongan-ji Temple in Osaka. Nobunaga Oda attacked Ikki, built Kanazawa Castle on the site, and placed Morimasa Sakuma. Later, Morimasa was defeated by Hideyoshi Hashiba in the Battle of Shizugatake, and Hideyoshi gave Kanazawa Castle to Toshiie Maeda. Toshiie began renovation work in the first year of Bunroku (1592), expanded the Kuruwa and moat, and built a five-storied castle tower and turret. Kenrokuen is a daimyo garden that was renovated by successive lords, with the predecessor of the lotus pond garden that was created by Tsunanori Maeda, the fifth lord of the Kaga domain, attached to Kanazawa Castle."
    },
	{
        "name": "21st Century Museum of Contemporary Art, Kanazawa",
        "location": {
            "latitude": 36.5608944,
            "longitude": 136.6581525
        },
        "description": "The 21st Century Museum of Contemporary Art, Kanazawa (Kanazawa Nijūisseiki Bijutsukan) is a museum of contemporary art located in Kanazawa, Ishikawa, Japan. The museum was designed by Japanese architects Kazuyo Sejima and Ryue Nishizawa of the architectural office SANAA in 2004. In October 2005, one year after its opening, the Museum marked 1,570,000 visitors."
    },
	{
        "name": "Hiashiyama",
        "location": {
            "latitude": 36.5734062,
            "longitude": 136.6591253
        },
        "description": "Higashiyama-Higashi is a district in Kanazawa, Ishikawa Prefecture, known as the Higashiyama-Higashi district. It is an important traditional building preservation district and is known as the Higashi Chayagai (Higashi Tea House District). About two-thirds of the 140 buildings in the district are traditional buildings, and many teahouse-style townhouses built from the time the teahouse town was founded to the beginning of the Meiji era (1868-1912) remain in the district. The town has become one of Kanazawa's main tourist attractions. After Sakuma Morimasa conquered Kanazawa Gobo and built Kanazawa Castle in 1580, Toshiie Maeda entered the castle in 1583, and Kanazawa Castle Town flourished as a castle town. The Kaga clan encouraged its residents to learn how to chant, and many of them learned to sing, and the scope of the practice expanded greatly. Kanazawa became a town where people said, \"Songs are falling from the sky. This is the kind of atmosphere that remains in Kanazawa. In the Edo period, many teahouses lined the Sagawa and Asano river area on the outskirts of the castle town. In 1820, with the permission of the Kaga Clan, the Nishi teahouse town on the west side of the Sagawa River and the Higashi teahouse town on the east side of the Asano River were both opened and became very busy in 1820. At this time, the old irregular shape of the district was changed and a more formal district was formed. Across the Asano River to the northwest is the main Chayamachi, a part of the Chayamachi district. On November 14, 2001, it was selected as a national important traditional building preservation district under the category of \"Chaya-machi\" because it retains the original site layout of the town when it was founded and has many buildings in the chaya style, which is rare in Japan. The teahouse \"Shima\" in Nibancho was designated a national important cultural property on December 25, 2003, due to its high historical value, and is open to the public. The teahouse is described in the traditional Kanazawa dialect as the setting of the story (former \"Atago-machi\") in the novel \"Onna\" by Kanazawa-born author Yuki Inoue."
    },
	{
        "name": "Kanazawa Station",
        "location": {
            "latitude": 36.5780443,
            "longitude": 136.6481714
        },
        "description": "Kanazawa Station is served by JR West and IR Ishikawa Railway's Kanazawa Station, which is also served by JR West's Hokuriku Shinkansen and Hokuriku Main Line and IR Ishikawa Railway's IR Ishikawa Railway Line. The IR Ishikawa Line is a \"parallel conventional line\" section of the Hokuriku Main Line, which was spun off from JR West when the Hokuriku Shinkansen started operating up to this station on March 14, 2015. All trains on the Hokuriku Main Line, including the \"Thunderbird\" limited express from the Osaka/Kyoto area and the \"Shirasagi\" limited express from the Nagoya/Maibara area, make their first and last stops, except one round-trip train of the \"Thunderbird\" (to and from Wakura Onsen Station on the Nanao Line). Before the opening of the Hokuriku Shinkansen line, many of these trains ran from this station to Toyama. Hokutetsu Kanazawa Station is located in the basement of the Kanazawa station's Kenrokuen station square (east entrance). The station was opened as \"Kanazawa Ekimae Station\" by Asanogawa Electric Railway, the predecessor of the Asanogawa Line, which was merged with the Hokuriku Railway and moved underground. In 2001, both JR Kanazawa Station and Hokuriku Railway Kanazawa Station were selected as one of the 100 best stations in Kanazawa. 2011 In 2011, the station was selected as one of the most beautiful stations in the world by Travel+Leisure (USA)."
    },
	{
        "name": "Oumicho Ichiba",
        "location": {
            "latitude": 36.5712847,
            "longitude": 136.6568157
        },
        "description": "Oumicho Ichiba is a market located in the center of Kanazawa, Ishikawa Prefecture, mainly consisting of retail shops selling foodstuffs, such as fresh produce, and household goods. Its name comes from the fact that it was built by an Omi merchant. Locals call it Omicho. Omi-Cho Ichiban was opened on April 16, 2009, as a result of an urban redevelopment project. It is located on the southeast side of the Musashi intersection (Musashigatsuji), the starting point of National Route 157 and other roads, and is relatively close to downtown Korinbo. With about 170 shops and restaurants (some media reports put the number at around 180 or 200) on an area of about 2,8 hectares, it is known as the \"Kanazawa Citizen's Kitchen. Many shops are selling Kaga vegetables and marine products, which are specialties of Ishikawa Prefecture, and the area is known as a sightseeing spot not only for the residents of Kanazawa but also for its unique characteristics. On the other hand, with the opening of the Hokuriku Shinkansen in 2015, the number of tourists and the increase in foreign visitors to Japan has led to a decline in the number of local users and problems with tourism pollution. The market has also responded to the increase in tourists by implementing measures such as improving the communication environment and introducing PayPay payments."
    },
	{
        "name": "Myoritu Temple",
        "location": {
            "latitude": 36.5553843,
            "longitude": 136.6489974
        },
        "description": "It was built by the third lord of the Kaga clan, Toshitsune Maeda. It is also called \"Ninja Temple\" because of its complex architectural structure and the tricks it uses to fool the enemy. The name \"Ninja Temple\" is a registered trademark of the temple. In 1583, when Toshiie Maeda, the founder of the clan, entered Kanazawa Castle, he sought a political philosophy based on the central spirit of Nichiren Buddhism and the Lotus Sutra and built a prayer hall to protect the clan. In 1643, Toshitsune, the third lord of the clan, moved the prayer hall from the vicinity of Kanazawa Castle and built it. To avoid the Tokugawa shogunate's change of fortune, Toshitsune deceived and reassured the shogunate by accepting a bride from the Tokugawa family, taking his mother as a hostage, and playing the role of a foolish lord by growing his nose hair. At the same time, he built a cluster of temples (today's Teramachi Temple Cluster) where many warriors could stay, and built Myoritsuji Temple in the center of the cluster as a watchtower (the main circle in the castle). Myoritsu-ji Temple, which served as a fortress, was equipped with hidden staircases, hidden rooms, pitfalls, watchtowers, and underground passages leading to Kanazawa Castle to deceive the enemy. It is called \"Ninja Temple\" not because there were ninjas in the temple, but because of the complex architectural structure of the temple. It is said to have been built by Nichiren's grandson, Nichizo. Myoritsuji, which survived the war, is revered as a place of prayer by successive feudal lords. The temple has withstood the heavy snowfall of the Hokuriku region, and its unique architectural style has been preserved to this day. The temple has endured the heavy snowfall of the Hokuriku region and its unique architectural style has been passed down to the present day, making it a popular spot for visitors. Due to the complexity and age of the building, tours are by appointment only and accompanied by a guide. There is a conservation and protection fee of 1,000 yen for adults and 700 yen for children. Preschool children are not allowed to visit. The building may be damaged by luggage or other objects hitting the back of the building, so you are not allowed to bring in luggage on the back."
    },
	{
        "name": "Oyama Shrine",
        "location": {
            "latitude": 36.5659637,
            "longitude": 136.6555481
        },
        "description": "Oyama Shrine is a shrine located in Kanazawa, Ishikawa Prefecture. It is one of the shrines dedicated to the ancestors of the clan that was popular in the late Edo and early Meiji periods. The main deities are Toshiie Maeda, the founder of the Kaga clan, and his wife, Matsue. The former status of the shrine is that of a separate governmental shrine. The shrine gate is designated as an important cultural property. A regular festival is held on April 27th, the anniversary of Toshiie's death. It is now a separate shrine of the main shrine office. The Shinmon Gate, which uses three architectural styles of Japanese, Chinese, and Western architecture, a rarity in Japan, is famous as a representative tourist attraction in Kanazawa. It has been designated as a national important cultural asset, and the gyamans inlaid into the top floor are particularly beautiful and attract visitors. It is also decorated with Japan's oldest surviving lightning rod. The building is lit up after sunset until 22:00, creating a magical atmosphere. The shrine is located between Kenrokuen, Kanazawa Castle, and the Nagamachi samurai residences and downtown area. The Shinmon Gate is a mixed design of Western and Japanese style, supported by a wooden structure: the first floor has three arches of masonry, with bricks on the masonry base and white plaster walls. I am."
    }
]