[
    {
        "name": "Kenrokuen",
        "location": {
            "latitude": 36.5621321,
            "longitude": 136.6604628
        },
        "description": "Kenrokuen is a Japanese garden located in Kanazawa City, Ishikawa Prefecture. It is designated as a national special scenic spot. The area is about 11.7 hectares. It is a pond spring strolling garden that represents the Edo period and originated from the clan garden built on the outer hull of Kanazawa Castle by the Kaga domain in the middle of the 17th century. It is counted as one of. In the \"Michelin Tourist Guide\" released on March 16, 2009, it was selected as the highest rated 3 star. The name of the garden was named because Matsudaira Sadanobu quoted \"Rakuyo Meienki\" and has six landscapes: Hongdae, Yue, Human Power, Aoko, Izumi, and View. Each of the four seasons has a deep taste and shows various expressions depending on the season, but especially the snow hanging that is done in preparation for snow is a winter tradition. It is also one of the best cherry blossom, plum, and autumn leaves spots in the prefecture, and has been selected as one of Japan's Top 100 Cherry Blossom Spots."
    },
	{
        "name": "Kanazawa Castle",
        "location": {
            "latitude": 36.5683812,
            "longitude": 136.6616254
        },
        "description": "It is a ladder-type Hirayama castle from the Warring States period to the Edo period, which was built at the tip of the Kodatsuno plateau between the Saigawa and Asano rivers that flow almost in the center of the Kanazawa plain (it was also called \"Oyama\"). Due to the terrain. The tip of the plateau was regarded as the tail of the mountain). The appearance of the white plastered walls with roof tiles and white lead tiles on the roof, which can be seen in the turrets and gates, and the windows of the Kara Gable and Irimaya Gable attached to the first turret and the wall are Kanazawa Castle. It is a characteristic of the architecture of. This place was the base of Kaga Ikko-ikki and was the temple of the Jodo Shinshu sect, \"Oyama Gobo\". Although it is a temple, it was also a fortress that can be called a castle around the stone wall, like Ishiyama Hongan-ji Temple in Osaka. Nobunaga Oda attacked Ikki, built Kanazawa Castle on the site, and placed Morimasa Sakuma. Later, Morimasa was defeated by Hideyoshi Hashiba in the Battle of Shizugatake, and Hideyoshi gave Kanazawa Castle to Toshiie Maeda. Toshiie began renovation work in the first year of Bunroku (1592), expanded the Kuruwa and moat, and built a five-storied castle tower and turret. Kenrokuen is a daimyo garden that was renovated by successive lords, with the predecessor of the lotus pond garden that was created by Tsunanori Maeda, the fifth lord of the Kaga domain, attached to Kanazawa Castle."
    }
]